---
type: DWFImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# DWFImportOptions

`Autodesk.Revit.DB.DWFImportOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DWFImportOptions | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSheetViews | 2014 | `public IList < ElementId > GetSheetViews ()` |
| Method | SetSheetViews | 2014 | `public void SetSheetViews ( IList < ElementId > sheetViews )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |